ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F67J60_registers.h
struct ECCP3ASBITS {
   unsigned int PSSBD0:1;
   unsigned int PSSBD1:1;
   unsigned int PSSAC2:1;
   unsigned int PSSAC3:1;
   unsigned int ECCPAS4:1;
   unsigned int ECCPAS5:1;
   unsigned int ECCPAS6:1;
   unsigned int ECCPASE:1;
} ECCP3ASbits;
#byte ECCP3ASbits = 0xF6A
#byte ECCP3AS = 0xF6A

struct ECCP3DELBITS {
   unsigned int PDC0:1;
   unsigned int PDC1:1;
   unsigned int PDC2:1;
   unsigned int PDC3:1;
   unsigned int PDC4:1;
   unsigned int PDC5:1;
   unsigned int PDC6:1;
   unsigned int PRSEN:1;
} ECCP3DELbits;
#byte ECCP3DELbits = 0xF69
#byte ECCP3DEL = 0xF69

struct ECCP2ASBITS {
   unsigned int PSSBD0:1;
   unsigned int PSSBD1:1;
   unsigned int PSSAC2:1;
   unsigned int PSSAC3:1;
   unsigned int ECCPAS4:1;
   unsigned int ECCPAS5:1;
   unsigned int ECCPAS6:1;
   unsigned int ECCPASE:1;
} ECCP2ASbits;
#byte ECCP2ASbits = 0xF68
#byte ECCP2AS = 0xF68

struct ECCP2DELBITS {
   unsigned int PDC0:1;
   unsigned int PDC1:1;
   unsigned int PDC2:1;
   unsigned int PDC3:1;
   unsigned int PDC4:1;
   unsigned int PDC5:1;
   unsigned int PDC6:1;
   unsigned int PRSEN:1;
} ECCP2DELbits;
#byte ECCP2DELbits = 0xF67
#byte ECCP2DEL = 0xF67

#byte EDATA = 0xF61

struct EIRBITS {
   unsigned int RXERIF:1;
   unsigned int TXERIF:1;
   unsigned int :1;
   unsigned int TXIF:1;
   unsigned int LINKIF:1;
   unsigned int DMAIF:1;
   unsigned int PKTIF:1;
} EIRbits;
#byte EIRbits = 0xF60
#byte EIR = 0xF60

struct ECON2BITS {
   unsigned int :5;
   unsigned int ETHEN:1;
   unsigned int PKTDEC:1;
   unsigned int AUTOINC:1;
} ECON2bits;
#byte ECON2bits = 0xEFE
#byte ECON2 = 0xEFE

struct ESTATBITS {
   unsigned int PHYRDY:1;
   unsigned int TXABRT:1;
   unsigned int RXBUSY:1;
   unsigned int :1;
   unsigned int LATECOL:1;
   unsigned int :1;
   unsigned int BUFER:1;
} ESTATbits;
#byte ESTATbits = 0xEFD
#byte ESTAT = 0xEFD

struct EIEBITS {
   unsigned int RXERIE:1;
   unsigned int TXERIE:1;
   unsigned int :1;
   unsigned int TXIE:1;
   unsigned int LINKIE:1;
   unsigned int DMAIE:1;
   unsigned int PKTIE:1;
} EIEbits;
#byte EIEbits = 0xEFB
#byte EIE = 0xEFB

#byte EDMACSH = 0xEF7

#byte EDMACSL = 0xEF6

#byte EDMADSTH = 0xEF5

#byte EDMADSTL = 0xEF4

#word EDMADST = 0xEF4

#byte EDMANDH = 0xEF3

#byte EDMANDL = 0xEF2

#word EDMAND = 0xEF2

#byte EDMASTH = 0xEF1

#byte EDMASTL = 0xEF0

#word EDMAST = 0xEF0

#byte ERXWRPTH = 0xEEF

#byte ERXWRPTL = 0xEEE

#word ERXWRPT = 0xEEE

#byte ERXRDPTH = 0xEED

#byte ERXRDPTL = 0xEEC

#word ERXRDPT = 0xEEC

#byte ERXNDH = 0xEEB

#byte ERXNDL = 0xEEA

#word ERXND = 0xEEA

#byte ERXSTH = 0xEE9

#byte ERXSTL = 0xEE8

#word ERXST = 0xEE8

#byte ETXNDH = 0xEE7

#byte ETXNDL = 0xEE6

#word ETXND = 0xEE6

#byte ETXSTH = 0xEE5

#byte ETXSTL = 0xEE4

#word ETXST = 0xEE4

#byte EWRPTH = 0xEE3

#byte EWRPTL = 0xEE2

#word EWRPT = 0xEE2

#byte EPKTCNT = 0xED9

struct ERXFCONBITS {
   unsigned int BCEN:1;
   unsigned int MCEN:1;
   unsigned int HTEN:1;
   unsigned int MPEN:1;
   unsigned int PMEN:1;
   unsigned int CRCEN:1;
   unsigned int ANDOR:1;
   unsigned int UCEN:1;
} ERXFCONbits;
#byte ERXFCONbits = 0xED8
#byte ERXFCON = 0xED8

#byte EPMOH = 0xED5

#byte EPMOL = 0xED4

#byte EPMCSH = 0xED1

#byte EPMCSL = 0xED0

#byte EPMM7 = 0xECF

#byte EPMM6 = 0xECE

#byte EPMM5 = 0xECD

#byte EPMM4 = 0xECC

#byte EPMM3 = 0xECB

#byte EPMM2 = 0xECA

#byte EPMM1 = 0xEC9

#byte EPMM0 = 0xEC8

#byte EHT7 = 0xEC7

#byte EHT6 = 0xEC6

#byte EHT5 = 0xEC5

#byte EHT4 = 0xEC4

#byte EHT3 = 0xEC3

#byte EHT2 = 0xEC2

#byte EHT1 = 0xEC1

#byte EHT0 = 0xEC0

#byte MIRDH = 0xEB9

#byte MIRDL = 0xEB8

#byte MIWRH = 0xEB7

#byte MIWRL = 0xEB6

#byte MIREGADR = 0xEB4

struct MICMDBITS {
   unsigned int MIIRD:1;
   unsigned int MIISCAN:1;
} MICMDbits;
#byte MICMDbits = 0xEB2
#byte MICMD = 0xEB2

struct MICONBITS {
   unsigned int :7;
   unsigned int RSTMII:1;
} MICONbits;
#byte MICONbits = 0xEB1
#byte MICON = 0xEB1

#byte MAMXFLH = 0xEAB

#byte MAMXFLL = 0xEAA

#byte MACLCON2 = 0xEA9

#byte MACLCON1 = 0xEA8

#byte MAIPGH = 0xEA7

#byte MAIPGL = 0xEA6

#byte MABBIPG = 0xEA4

struct MACON4BITS {
   unsigned int :4;
   unsigned int NOBKOFF:1;
   unsigned int BPEN:1;
   unsigned int DEFER:1;
} MACON4bits;
#byte MACON4bits = 0xEA3
#byte MACON4 = 0xEA3

struct MACON3BITS {
   unsigned int FULDPX:1;
   unsigned int FRMLNEN:1;
   unsigned int HFRMEN:1;
   unsigned int PHDREN:1;
   unsigned int TXCRCEN:1;
   unsigned int PADCFG5:1;
   unsigned int PADCFG6:1;
   unsigned int PADCFG2:1;
} MACON3bits;
#byte MACON3bits = 0xEA2
#byte MACON3 = 0xEA2

struct MACON1BITS {
   unsigned int MARXEN:1;
   unsigned int PASSALL:1;
   unsigned int RXPAUS:1;
   unsigned int TXPAUS:1;
} MACON1bits;
#byte MACON1bits = 0xEA0
#byte MACON1 = 0xEA0

#byte EPAUSH = 0xE99

#byte EPAUSL = 0xE98

struct EFLOCONBITS {
   unsigned int FCEN0:1;
   unsigned int FCEN1:1;
   unsigned int FULDPXS:1;
} EFLOCONbits;
#byte EFLOCONbits = 0xE97
#byte EFLOCON = 0xE97

struct MISTATBITS {
   unsigned int BUSY:1;
   unsigned int SCAN:1;
   unsigned int NVALID:1;
   unsigned int LINKFL:1;
} MISTATbits;
#byte MISTATbits = 0xE8A
#byte MISTAT = 0xE8A

#byte MAADR2 = 0xE85

#byte MAADR1 = 0xE84

#byte MAADR4 = 0xE83

#byte MAADR3 = 0xE82

#byte MAADR6 = 0xE81

#byte MAADR5 = 0xE80

